In [1]:
import pandas as pd
import numpy as np

In [15]:
df = pd.DataFrame({'Name': ['Ali','Ahsan','Hamza','Umer','Ali'],
                   'Marks':[34,45,np.nan,np.nan,50],
                   'Age':(np.random.randint(10,25,size=[5]))})
np.random.seed(5)

In [16]:
df

    Name  Marks  Age
0    Ali   34.0   13
1  Ahsan   45.0   24
2  Hamza    NaN   23
3   Umer    NaN   16
4    Ali   50.0   16

In [20]:
df.Age.iloc[3] = np.nan
df.Age.iloc[1]=np.nan
df

    Name  Marks   Age
0    Ali   34.0  13.0
1  Ahsan   45.0   NaN
2  Hamza    NaN  23.0
3   Umer    NaN   NaN
4    Ali   50.0  16.0

In [28]:
df["Age"].fillna(method='ffill',inplace = True)
df

    Name  Marks   Age
0    Ali   34.0  13.0
1  Ahsan   45.0  13.0
2  Hamza    NaN  23.0
3   Umer    NaN  23.0
4    Ali   50.0  16.0

In [29]:
df.duplicated(["Age"])

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [30]:
df.drop_duplicates(["Age"])

    Name  Marks   Age
0    Ali   34.0  13.0
2  Hamza    NaN  23.0
4    Ali   50.0  16.0

In [32]:
df.drop_duplicates(["Age"],keep='last')

    Name  Marks   Age
1  Ahsan   45.0  13.0
3   Umer    NaN  23.0
4    Ali   50.0  16.0

In [36]:
Father_Name = {'Ali':'Abdullah', 'Ahsan':'Umer','Hamza':'Ali','Umer':'Hamza'}

In [40]:
df["Father_Name"] = df['Name'].map(Father_Name)

In [43]:
df

    Name  Marks   Age Father_Name
0    Ali   34.0  13.0    Abdullah
1  Ahsan   45.0  13.0        Umer
2  Hamza    NaN  23.0         Ali
3   Umer    NaN  23.0       Hamza
4    Ali   50.0  16.0    Abdullah

In [48]:
df['Name']=df.Name.replace(to_replace = 'Ali',value ='Taha')

In [49]:
df

    Name  Marks   Age Father_Name
0   Taha   34.0  13.0    Abdullah
1  Ahsan   45.0  13.0        Umer
2  Hamza    NaN  23.0         Ali
3   Umer    NaN  23.0       Hamza
4   Taha   50.0  16.0    Abdullah

    Name  Marks   Age Father_Name
0   Taha   34.0  13.0    Abdullah
1  Ahsan   45.0  13.0        Umer